WHeiu/Drone-control-project/无人机管控模块/MPU9250/stm32_new_HL - V3 无修改版/stm32_new_HL - V3/stm32_new/Src/main.c
  return ch;
}
void Delay(unsigned int xms)  // xms
{
    unsigned int x,y;
    for(x=xms;x>0;x--)
        for(y=2000;y>0;y--);
}
char * EC20_sendmsg_cmd1[]={
	"AT+CPMS?\r\n",
	"AT+CNMI=1\r\n",
	"AT+CSCA?\r\n",
	"AT+CMGF=1\r\n",
};
void EC20_Transmit(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
	 HAL_UART_Transmit(&huart4, (uint8_t*)UART4_Tx,size,50);
}
void EC20_Transmit_Printf(uint8_t* UART4_Tx)
{ 
	 int size=strlen((const char*)UART4_Tx);
	 HAL_UART_Transmit(&huart3, (uint8_t*)UART4_Tx,size,50);
}
void EC20_Receive()
{
	   HAL_UART_Receive(&huart4, (uint8_t*)ReceiveBuff, COUNTOF(ReceiveBuff),50);
		/*打印收到的数据*/
    for(int i=0;i<COUNTOF(ReceiveBuff);i++)
    {
			  if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
				{  
					printf("OK\r\n");
					break;
				}
				if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
				{  
					printf("\n****** 	\n");
					break;
				}
				if(ReceiveBuff[i]=='0'&&ReceiveBuff[i+1]=='0'&&ReceiveBuff[i+2]=='0'&&ReceiveBuff[i+3]=='0')
				{  
					break;
				}
        printf("%c",ReceiveBuff[i]);
    }
    printf("\r\n"); 
    for(int i=0;i<=(COUNTOF(ReceiveBuff) - 1);i++)
		{
			if(ReceiveBuff[i]==':'&&ReceiveBuff[i-1]=='C'&&ReceiveBuff[i-2]=='O')
			{
				 i++;
				 for(int j=0;i<=(COUNTOF(ReceiveBuff) - 1);i++,j++)
					{
							/* 转换：之后的GPS数据 给GPS_DATA*/
						   if(ReceiveBuff[i]=='\0'&&ReceiveBuff[i+1]=='\0'&&ReceiveBuff[i+2]=='\0'&&ReceiveBuff[i+3]=='\0')
								{  
									printf("\n****** 	\n");
									break;
								}
								
						   GPS_DATA_RECEIVE[j]=ReceiveBuff[i];
							 if(ReceiveBuff[i]=='O'&&ReceiveBuff[i+1]=='K')
								{
									 printf("GPS数据\n");   
									break;
								}
								
							 printf("%c",ReceiveBuff[i]);
							 
					}
				}
		}			
		/*清空数据缓存*/
    for(int i = 0; i < COUNTOF(ReceiveBuff); i++) 
    ReceiveBuff[i]=0;
			
}
void EC20_Init()
{
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);
			HAL_Delay(200);	
			
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_RESET);//拉高控制
			HAL_Delay(300);	

			EC20_UART_PROT_INIT();//改变EC20 的串口模式
			HAL_Delay(200);
			
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_SET);//初始化完成
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  //int i=0;
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
 
	uint32_t Uart_count=0;  //Uart_count is used to test uart 
	
	uint8_t Flag_test=SUCCFULL_STA;    //set one
	uint8_t Flag_run =SUCCFULL_STA-1;  //set zero
	
	uint32_t ADC_Value[50];
	uint32_t ad1;
	uint8_t  ADC_i;

	uint8_t UART4_Tx_TEST1[]="AT+CSQ\r\n";
	uint8_t UART4_Tx_TEST2[]="ATD13036699696\r\n";
	uint8_t UART4_Tx_TEST3[]="AT+CPIN?\r\n";
	uint8_t UART4_Tx_TEST4[]="AT+CMGF=1\r\n";
	uint8_t UART4_Tx_TEST5[]="ATI\r\n";
	
	/*电话（可变）*/
	uint8_t UART4_Tx_TEST6[]="AT+CMGS=\"13036699696\"\r\n";
	uint8_t UART4_Tx_TEST7[]="AT+CMEE=2\r\n";
	
	
	uint8_t UART4_Tx_GPS_TEST1[]="AT+QGPS=1\r\n";
	uint8_t UART4_Tx_GPS_TEST2[]="AT+QGPSLOC?\r\n";
	uint8_t UART4_Tx_GPS_TEST3[]="AT+QGPSCFG=\"gpsnmeatype\",1\r\n";

	/*IP 地址口（可变）*/
  uint8_t UART4_Tx_TCP_TEST1[]="AT+QIOPEN=1,0,\"TCP\",\"119.27.184.248\",1234,0,1\r\n";
	uint8_t UART4_Tx_TCP_TEST2[]="AT+QISEND=0\r\n";
	uint8_t UART4_Tx_TCP_TEST3[]="AT+QICLOSE=0\r\n";
	
  uint8_t UART4_Tx_Flag_end[]={0x1A};
	uint8_t UART4_Tx_CMGS_ER[]="ERROR!!\n";
	uint8_t UART4_Tx_CMGS_end[]={0x1A};
	
	uint8_t UART4_Tx_MESSAGE1[]="AT+CPMS?\r\n";
	uint8_t UART4_Tx_MESSAGE2[]="AT+CNMI=1,2,0,1,0\r\n";
	uint8_t UART4_Tx_MESSAGE3[]="AT+CSCA?\r\n";
	uint8_t UART4_Tx_MESSAGE4[]="AT+CMGF=1\r\n";
	
	
	uint8_t UART4_Tx_CMGS[]="HELLO,WORLD!!!CONNECTED SUCUSSFUL!!!\n";

	
	uint8_t tempdata[50]={0};
	
	uint8_t Atempdata1[50]={0};
	uint8_t Atempdata2[50]={0};
	uint8_t Atempdata3[50]={0};
	
	uint8_t tempdata1[20]={0};
	uint8_t tempdata2[20]={0};
	uint8_t tempdata3[20]={0};
	uint8_t tempdata4[20]={0};
	uint8_t tempdata5[20]={0};
	uint8_t tempdata6[20]={0};
	uint8_t tempdata7[20]={0};
	
	uint8_t test_count=0;
	uint8_t test_flag=1;
	uint8_t count_ex=100;
	uint8_t count_OK=0;
	uint8_t *pTempdate;
	uint8_t m=0;
	uint8_t test_counter_polling=0;
	pTempdate=tempdata;
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_CRC_Init();
  MX_QUADSPI_Init();
  MX_SPI1_Init();
  MX_SPI2_Init();
  MX_UART4_Init();
  MX_USART1_UART_Init();
  MX_USART2_UART_Init();
  MX_USART3_UART_Init();
  MX_ADC1_Init();
  MX_RTC_Init();
  MX_USB_OTG_FS_HCD_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */
	
	/*************init the BMP280****************/
  if (BMP280_Begin() == -1)
    bmp_data.err_cnt++;
	printf("finshed the inition of BMP280.  \n");
	
	/*************init the MPU9250****************/
	Init_MPU9250();
	printf("finshed the inition of MPU9250.  \n");
	
	HAL_GPIO_WritePin(GPIOA,GPIO_PIN_10,GPIO_PIN_SET);//TURN ON LED_RED 
	
	/*************init the EC20****************/	
  //EC20初始化 ,先拉高在拉低
	printf("initing the EC20 ....  \n");
	
  EC20_Init();
	printf("Finished \n");

	/********init the RTC*******************/
	RTC_HandleTypeDef RtcHandle;
	RTC_TimeTypeDef stimestructureget;
	__HAL_RTC_RESET_HANDLE_STATE(&RtcHandle);
  RtcHandle.Instance = RTC;
  RtcHandle.Init.HourFormat     = RTC_HOURFORMAT_12;
  RtcHandle.Init.AsynchPrediv   = RTC_ASYNCH_PREDIV;
  RtcHandle.Init.SynchPrediv    = RTC_SYNCH_PREDIV;
  RtcHandle.Init.OutPut         = RTC_OUTPUT_DISABLE;
  RtcHandle.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
  RtcHandle.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;
	
	/*********SEND THE DATA TO GROUND AND SET THE FLAG********/
	#if 0
	
	/*要求所需的矫正*/
	tcp_connect_sever("101.207.17.199","1113");
	uint8_t Test_senddata[11]={'H' ,'E' , 'L' , 'L' , 'O',  'I',  'T',  'I',  'S' , 'M' , 'E' , '!'};
	uint8_t Test_receivedata_example[11]={'!' ,'E'  , 'M'  ,'S' , 'I' , 'T' , 'I' , 'O'  ,'L'  ,'L' , 'E' , 'H' };
	uint8_t Test_receivedata[11]=(0);
	#endif
	
