WHeiu/Drone-control-project/无人机管控模块/MPU9250/stm32_new_HL - V3 无修改版/stm32_new_HL - V3/stm32_new/Src/main.c
	//HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&ADC_Value, 100); //send ADC_data to ADC_value
	     
	printf("This is a USART DMA Receive Test!!!\r\n");
     
  /*启动GPS接收*/
	EC20_uart4_send((uint8_t*)UART4_Tx_GPS_TEST1);
	HAL_Delay(500);
				printf("000000\n\n\n\n\n");
	/*打印AT错误信息*/
	EC20_uart4_send((uint8_t*)UART4_Tx_TEST7);
				printf("111111 \n\n\n\n\n");

	/*开启IDLE中断*/
	__HAL_UART_ENABLE_IT(&huart4, UART_IT_IDLE);
			printf("222222 \n\n\n\n\n");
	/*启动DMA接收*/
	//HAL_UART_Receive_DMA(&huart4,ReceiveBuff,BUFFERSIZE);
			printf("333333 \n\n\n\n\n");
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
		HAL_GPIO_TogglePin(GPIOB,GPIO_PIN_2);

#if 1
    
		//获得MPU9250寄存器原始数据
		printf("MPU9250 test \r\n\n\n\n\n");
		READ_MPU9250_MAG();
		READ_MPU9250_ACCEL();
		READ_MPU9250_GYRO();
		
		//进行姿态融合
		AHRSupdate(gx, gy, gz, ax,ay, az, mx, my, mz);
		
	  //打印寄存器读出的原始数据
		printf("Mag: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);    
		printf("Gyro: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);
		printf("Accel: x:%d \ty:%d\tz:%d   \r\n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);
		printf("******************************************** \r\n\n\n\n\n");
		printf("mx:%0.3f \tmy:%0.3f\tmz:%0.3f   \r\n", mx,my,mz);
		printf("gx:%0.3f \tgy:%0.3f\tgz:%0.3f   \r\n", gx,gy,gz);
		printf("ax:%0.3f \tay:%0.3f\taz:%0.3f   \r\n", ax,ay,az);
		printf("******************************************** \r\n\n\n\n\n");
		printf("pitch: x:%.3f\r\n",pitch);
		printf("roll: x:%.3f\r\n", roll);
		printf("yaw: x:%.3f\r\n",yaw);
	
/*
		//Bmp280
		bmp_data.v_actual_temp_float = BMP280_ReadTemperature();
		bmp_data.actual_press_u64 = BMP280_ReadPressure_int64();
		bmp_data.v_actual_press_float = BMP280_ReadPressure();


		printf("T32: %u 'C  \n", bmp_data.v_actual_temp_s32);
		printf("P32: %u Pa  \n", bmp_data.v_actual_press_u32);
		printf("P64: %.3f Pa \n", (float)bmp_data.actual_press_u64 / 256.0f);
		printf("Tf: %.3f  'C \n", bmp_data.v_actual_temp_float);
		printf("Pf: %.3f Pa  \n", bmp_data.v_actual_press_float);


		float altitude, seaLevelhPa, mmHg;
		mmHg = bmp_data.v_actual_press_float / 133.321995f;
				printf("%.2f mmHg \n", mmHg);

		seaLevelhPa = 101325.0f;   
				altitude = 44330 * (1.0 - pow((double)(bmp_data.v_actual_press_float / seaLevelhPa), 0.19029));
				printf( "%.2f m  \n", altitude);
   

		printf(" \nerror: %u \n", bmp_data.err_cnt);
    
*/		
#endif
		printf(" \r\n************************************ \r\n");
/*		
		sprintf((char*)Atempdata1,"Mag: x:%d \ty:%d\tz:%d   \n", mpu_value.Mag[0],mpu_value.Mag[1],mpu_value.Mag[2]);
		sprintf((char*)Atempdata2,"Gyro: x:%d \ty:%d\tz:%d   \n", mpu_value.Gyro[0],mpu_value.Gyro[1],mpu_value.Gyro[2]);
		sprintf((char*)Atempdata3,"Accel: x:%d \ty:%d\tz:%d   \n", mpu_value.Accel[0],mpu_value.Accel[1],mpu_value.Accel[2]);
		
		
		sprintf((char*)tempdata1,"T32: %u 'C  \n", bmp_data.v_actual_temp_s32);
		sprintf((char*)tempdata2,"P32: %u Pa  \n", bmp_data.v_actual_press_u32);
		sprintf((char*)tempdata3,"P64: %.3f Pa \n", (float)bmp_data.actual_press_u64 / 256.0f);
		sprintf((char*)tempdata4,"Tf: %.3f  'C \n", bmp_data.v_actual_temp_float);
		sprintf((char*)tempdata5,"Pf: %.3f Pa  \n", bmp_data.v_actual_press_float);
		
		sprintf((char*)tempdata6,"%.2f mmHg \n", mmHg);
		sprintf((char*)tempdata7,"%.2f m  \n", altitude);
*/    
//		printf(" \r\n************************************ \r\n");
//		//数据转换为字符串并发送
//		EC20_Transmit_Printf((uint8_t*)Atempdata1);
//		EC20_Transmit_Printf((uint8_t*)Atempdata2);
//		EC20_Transmit_Printf((uint8_t*)Atempdata3);
//		
//		EC20_Transmit_Printf((uint8_t*)tempdata1);
//		EC20_Transmit_Printf((uint8_t*)tempdata2);
//		EC20_Transmit_Printf((uint8_t*)tempdata3);
//		EC20_Transmit_Printf((uint8_t*)tempdata4);
//		EC20_Transmit_Printf((uint8_t*)tempdata5);
//		EC20_Transmit_Printf((uint8_t*)tempdata6);
//		EC20_Transmit_Printf((uint8_t*)tempdata7);
//		printf(" \r\nTest \r\n");
		

#if 0//GPRS test
	
		/*数据连接中断一次不可再连接，需重新启动或者关闭网络20秒左右后方能连接*/
		if(test_counter_polling==20)
		{
		  EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST1);
			test_counter_polling=0;
		}
		test_counter_polling++;
		/*询问GPS定位信息*/
		EC20_Transmit((uint8_t*)UART4_Tx_GPS_TEST2);
		/*接受串口数据*/		
	  EC20_Receive();
	 
		
		
		/*开启直传模式*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST1);
	  EC20_Receive();
		
    /*开启传送开关*/
		EC20_Transmit((uint8_t*)UART4_Tx_TCP_TEST2);
	  EC20_Receive();
		
		
		/*传送TCP数据*/
		
		/*（1）传送GPS数据*/
	  EC20_Transmit((uint8_t*)GPS_DATA_RECEIVE);
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		/*（2）传送传感器数据*/
		
		/*传送BMP9250数据*/
		EC20_Transmit((uint8_t*)Atempdata1);
		EC20_Transmit((uint8_t*)Atempdata2);
		EC20_Transmit((uint8_t*)Atempdata3);
		
		/*传送BMP280数据*/
		EC20_Transmit((uint8_t*)tempdata1);
		EC20_Transmit((uint8_t*)tempdata2);
		EC20_Transmit((uint8_t*)tempdata3);
		EC20_Transmit((uint8_t*)tempdata4);
		EC20_Transmit((uint8_t*)tempdata5);
		EC20_Transmit((uint8_t*)tempdata6);
		EC20_Transmit((uint8_t*)tempdata7);
		
		EC20_Transmit((uint8_t*)UART4_Tx_Flag_end);//结束标志0x1A
		EC20_Receive();
		
		
		/*打印并清除数据*/
		printf("\n数据如下：\n");
		 for(int i = 0; i < COUNTOF(GPS_DATA_RECEIVE); i++) 
    {
			printf("%c",ReceiveBuff[i]);
			GPS_DATA_RECEIVE[i]=0;
		}
		
		/*初始化检测*/
    test_flag=HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_15);
		
    /*如果检测STATE口为低，重新检测并初始化*/
		if(test_flag==1)
		{
			
      EC20_Init();
			test_count++;
			if(test_count==10)
			{
				printf("EC20断电失败\n");
				test_count=0;
				break;
			}
	  }
#endif
				

#if 0 //adc采样，采样电池
				HAL_Delay(500);
        for(ADC_i = 0,ad1 =0; ADC_i< 100;)
        {
            ad1 += ADC_Value[ADC_i++];

        }
        ad1 /= 50;
        printf("\r\n******** ADC DMA Example ********\r\n\r\n");
        printf(" AD1 value = %1.3fV \r\n", ad1*3.3f/4096);


#endif


#if 0 //ec20数据整合
		
			/**********Send the data to the Ground and check it****************/
//			if(HAL_UART_Transmit_IT(&huart4, (uint8_t *)Test_senddata, sizeof(Test_senddata)) != HAL_OK)
//			{
//					Error_Handler();
//			}
//			Delay(100);
//		
//			if(HAL_UART_Receive_IT(&huart4, (uint8_t *)Test_receivedata, sizeof(Test_receivedata)) != HAL_OK)
//			{
//				Error_Handler();
//			}
//			
//		for(uint8_t comparecount=0,Different_flag=0;comparecount<=sizeof(Test_receivedata);comparecount++)//??辫?箨?????陏?Y
//		{	
//			/*****************COMPARE the flag of the data which form Ground*********************/
//			if(Test_receivedata[comparecount]==Test_receivedata_example[comparecount])
//			{
//				Different_flag++;
//				printf(" Connect %u  \n", Different_flag);
//			}
//			/***************If receive the data from Ground,begain send the data*************/
//			if(Different_flag==sizeof(Test_senddata))
//			{
//				Flag_run=SUCCFULL_STA;//enable the data of GPRS
//			}
//		}
	
